import pandas as pd
import plotly.express as px
import numpy as np
import plotly.graph_objects as go

data = 'data_analize/data_dropout_59-64.xlsx'
df = pd.read_excel(data)

MAJOR_NAME_THAI = ['วิศวกรรมไฟฟ้า', 'วิศวกรรมเครื่องกล', 'วิศวกรรมเหมืองแร่',
       'วิศวกรรมโยธา', 'วิศวกรรมเคมี', 'วิศวกรรมเมคาทรอนิกส์',
       'วิศวกรรมวัสดุ', 'ยังไม่แยกสาขาวิชา', 'วิศวกรรมคอมพิวเตอร์',
       'วิศวกรรมการผลิต', 'วิศวกรรมอุตสาหการ', 'วิศวกรรมชีวการแพทย์',
       'วิศวกรรมสิ่งแวดล้อม', 'วิศวกรรมและการจัดการนวัตกรรม',
       'วิศวกรรมเหมืองแร่และวัสดุ', 'วิศวกรรมปัญญาประดิษฐ์']

DEPT_NAME_THAI = ['ภาควิชาวิศวกรรมไฟฟ้า', 'ภาควิชาวิศวกรรมเครื่องกล',
       'ภาควิชาวิศวกรรมเหมืองแร่และวัสดุ', 'ภาควิชาวิศวกรรมโยธา',
       'ภาควิชาวิศวกรรมเคมี', 'คณะวิศวกรรมศาสตร์',
       'ภาควิชาวิศวกรรมคอมพิวเตอร์', 'ภาควิชาวิศวกรรมอุตสาหการ']

PREV_INSTITUTION_NAME = [s for s in df["PREV_INSTITUTION_NAME"].unique() if s != ""]

ENT_METHOD_DESC = ['โครงการ "ทุนมงคลสุข"',
       'โครงการคัดเลือกนักเรียนใน 14  จังหวัดภาคใต้ เข้าศึกษาโดยวิธีรับตรง (โควตาภูมิภาค)',
       'โครงการรับนักเรียนที่มีผลการเรียนดี',
       'โครงการคัดเลือกบุคคลเข้าศึกษาโดยใช้ผลคะแนนสอบ GAT/PAT และวิชาสามัญ 9 วิชา',
       'โครงการส่งเสริมผู้มีคุณธรรม จริยธรรม บำเพ็ญประโยชน์ช่วยเหลือสังคม',
       'โครงการความร่วมมือกับมูลนิธิส่งเสริมโอลิมปิกวิชาการและพัฒนามาตรฐานวิทยาศาสตร์ในพระอุปถัมภ์ (สอวน.)',
       'โครงการรับนักศึกษาภายใต้ห้องเรียนวิทยาศาสตร์โดยการกำกับดูแลของมหาวิทยาลัย (วมว.)',
       'โครงการ "ลูกพระราชบิดา "', 'โครงการดาวรุ่งคอมพิวเตอร์',
       'โครงการคัดเลือกผู้มีความสามารถด้านกีฬา',
       'โครงการ "โควตาวิศวกรรมศาสตร์ มอ."', 'Admission',
       'ทุนอุดมศึกษาจังหวัดชายแดนภาคใต้(ศอ.บต.)', 'โควตา',
       'สอบตรง(รับตรง 14 จังหวัดภาคใต้)',
       'สอบตรงทั่วประเทศ โครงการรับตรงใช้คะแนน GAT / PAT และวิชาสามัญ 7 วิชา\xa0(เพิ่มเป็น 9 วิชา เมื่อปี 59)',
       'โครงการดาวรุ่งคอมพิวเตอร์ ประเภทที่ 2',
       'โครงการรับนักเรียนเพื่อผลิตต้นแบบบัณฑิต  AEC',
       'โครงการผลิตและพัฒนาบุคลากรภายใต้ความร่วมมือระหว่างมูลนิธิชัยพัฒนาและมหาวิทยาลัยสงขลานครินทร์',
       'โครงการรับนักศึกษาโดยวิธีพิเศษ (โควตา) นักเรียนในโรงเรียนทั่วประเทศ สาขาวิชาวิศวกรรมคอมพิวเตอร์',
       'โครงการ ม.อ. ภูเก็ตมุ่งมั่นตั้งใจดี',
       'โครงการรับนักศึกษาโดยวิธีพิเศษ (โควตา) นักเรียนในโรงเรียน14จังหวัดภาคใต้ สาขาวิชาวิศวกรรมคอมพิวเตอร์',
       'โครงการส่งเสริมผู้มีคุณธรรม จริยธรรม บำเพ็ญประโยชน์ช่วยเหลือสังคม ',
       'โครงการโควตาพิเศษ (รับนักศึกษา ปวช.)',
       'โครงการคัดเลือกนักเรียนเข้าศึกษาในคณะวิศวกรรมศาสตร์ สาขาวิชาวิศวกรรมและการจัดการนวัตกรรม ',
       'โครงการการคัดเลือกบุคคลเข้าศึกษาระดับปริญญาตรี รอบที่ 3 รับตรงกลางกัน (Admission 2)']

FUND_NAME_CODE = ['Y', 'N', 'other']

PARENTS_MARRIED_NAME = ['บิดาถึงแก่กรรม', 'บิดาแต่งงานใหม่', 'บิดาและมารดาถึงแก่กรรม', 
                        'บิดาและมารดาแต่งงานใหม่', 'มารดาถึงแก่กรรม', 'มารดาแต่งงานใหม่', 
                        'หย่าร้าง', 'อยู่ด้วยกัน', 'แยกกันอยู่เพราะความจำเป็นเกี่ยวกับอาชีพ', 
                        'แยกกันอยู่เพราะสาเหตุอื่น','อื่น ๆ']